benchmark/web/results/result_w2_1.log
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/json
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 58 sec, 579 millisec and 771 microsec, 85353 req/s, 24755 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1485000000 bytes total, 1105000000 bytes http, 380000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/json
Running 1m test @ http://10.0.1.3:8080/json
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77ms    2.38ms  30.04ms   94.21%
    Req/Sec    12.00k     1.55k   15.08k    67.94%
  Latency Distribution
     50%    1.20ms
     75%    1.41ms
     90%    1.92ms
     99%   15.10ms
  5739472 requests in 1.00m, 1.59GB read
Requests/sec:  95496.27
Transfer/sec:     27.05MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=256
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 55 sec, 766 millisec and 911 microsec, 89658 req/s, 33534 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1915000000 bytes total, 635000000 bytes http, 1280000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=256
Running 1m test @ http://10.0.1.3:8080/resource?count=256
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    2.48ms  31.10ms   94.16%
    Req/Sec    12.17k     1.57k   15.28k    65.95%
  Latency Distribution
     50%    1.16ms
     75%    1.38ms
     90%    1.87ms
     99%   15.64ms
  5822608 requests in 1.00m, 2.08GB read
Requests/sec:  96879.42
Transfer/sec:     35.39MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=4096
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 70 sec, 431 millisec and 591 microsec, 70990 req/s, 292837 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 21120000000 bytes total, 640000000 bytes http, 20480000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=4096
Running 1m test @ http://10.0.1.3:8080/resource?count=4096
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.52ms    3.37ms  28.75ms   90.54%
    Req/Sec     9.48k     1.23k   12.67k    60.69%
  Latency Distribution
     50%    1.37ms
     75%    1.83ms
     90%    5.25ms
     99%   18.51ms
  4527394 requests in 1.00m, 17.81GB read
Requests/sec:  75448.53
Transfer/sec:    303.93MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=65536
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 338 sec, 927 millisec and 949 microsec, 14752 req/s, 946011 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 328325000000 bytes total, 645000000 bytes http, 327680000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=65536
Running 1m test @ http://10.0.1.3:8080/resource?count=65536
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.11ms    8.20ms 110.33ms   84.63%
    Req/Sec     1.87k   189.76     2.47k    67.65%
  Latency Distribution
     50%    6.96ms
     75%   11.48ms
     90%   23.37ms
     99%   35.90ms
  891705 requests in 1.00m, 54.53GB read
Requests/sec:  14854.12
Transfer/sec:      0.91GB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 172 sec, 328 millisec and 665 microsec, 29014 req/s, 8103 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1430000000 bytes total, 1360000000 bytes http, 70000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/
Running 1m test @ http://10.0.1.3:8080/
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.72ms    3.90ms  43.04ms   94.26%
    Req/Sec     3.90k   579.62    25.29k    83.02%
  Latency Distribution
     50%    3.71ms
     75%    3.85ms
     90%    5.62ms
     99%   25.78ms
  1861753 requests in 1.00m, 507.79MB read
Requests/sec:  30968.43
Transfer/sec:      8.45MB